Revit 2027 API
ParameterTypeId.Profile1Angle Property
 "Angle"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Profile1Angle { get; }
Public Shared ReadOnly Property Profile1Angle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Profile1Angle {
	ForgeTypeId^ get ();
}
static member Profile1Angle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace